Информационная_база/src/Documents/РеализацияТоваров/РеализацияТоваров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>РеализацияТоваров</name>
  <registerRecords>AccumulationRegister.СебестоимостьТоваров</registerRecords>
  <registerRecords>AccumulationRegister.РасчетыСКлиентами</registerRecords>
  <registerRecords>AccumulationRegister.Продажи</registerRecords>
  <registerRecords>AccumulationRegister.ТоварыНаСкладах</registerRecords>
  <registerRecords>AccountingRegister.РегистрБухгалтерии</registerRecords>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Сотрудник</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВалютаДокумента</name>
    <type>
      <types>EnumRef.Валюта</types>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Товар</name>
      <type>
        <types>CatalogRef.Товары</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиТоваров</types>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Информационная_база/src/AccumulationRegisters/ТоварыНаСкладах/ТоварыНаСкладах.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ТоварыНаСкладах</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Товар</name>
    <type>
      <types>CatalogRef.Товары</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ХарактеристикаТовара</name>
    <type>
      <types>CatalogRef.ХарактеристикиТоваров</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Информационная_база/src/AccumulationRegisters/РасчетыСКлиентами/РасчетыСКлиентами.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>РасчетыСКлиентами</name>
  <resources>
    <name>СуммаДолга</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Информационная_база/src/AccumulationRegisters/СебестоимостьТоваров/СебестоимостьТоваров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>СебестоимостьТоваров</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Стоимость</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Товар</name>
    <type>
      <types>CatalogRef.Товары</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Партия</name>
    <type>
      <types>DocumentRef.ПоступлениеТоваров</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ХарактеристикаТовара</name>
    <type>
      <types>CatalogRef.ХарактеристикиТоваров</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Информационная_база/src/AccumulationRegisters/Продажи/Продажи.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>Продажи</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Себестоимость</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Выручка</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Товар</name>
    <type>
      <types>CatalogRef.Товары</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Информационная_база/src/AccountingRegisters/РегистрБухгалтерии/РегистрБухгалтерии.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccountingRegister>
  <name>РегистрБухгалтерии</name>
  <chartOfAccounts>ChartOfAccounts.БухУчет</chartOfAccounts>
  <correspondence>true</correspondence>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
    <balance>true</balance>
  </resources>
</mdclass:AccountingRegister>

Информационная_база/src/ChartsOfAccounts/БухУчет/БухУчет.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:ChartOfAccounts>
  <name>БухУчет</name>
  <predefined>
    <items>
      <name>Товары</name>
      <description>Товары</description>
      <code>01   </code>
      <accountType>ActivePassive</accountType>
    </items>
    <items>
      <name>Расчеты</name>
      <description>Расчеты</description>
      <code>02   </code>
      <accountType>ActivePassive</accountType>
      <childItems>
        <name>Клиенты</name>
        <description>Клиенты</description>
        <code>02.01</code>
        <accountType>ActivePassive</accountType>
      </childItems>
      <childItems>
        <name>Поставщики</name>
        <description>Поставщики</description>
        <code>02.02</code>
        <accountType>ActivePassive</accountType>
      </childItems>
    </items>
    <items>
      <name>Касса</name>
      <description>Касса</description>
      <code>03   </code>
      <accountType>ActivePassive</accountType>
    </items>
  </predefined>
</mdclass:ChartOfAccounts>

Информационная_база/src/Documents/РеализацияТоваров/ObjectModule.bsl
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Если ОбменДанными.Загрузка Тогда
     Возврат;
	КонецЕсли;
	ЭтотОбъект.СуммаДокумента = ЭтотОбъект.Товары.Итог("Сумма");
КонецПроцедуры


 

Процедура ОбработкаПроведения(Отказ,Режим)
	
	Движения.ТоварыНаСкладах.Записывать = Истина;
	Движения.РасчетыСКлиентами.Записывать = Истина;
	
	Движение = Движения.РасчетыСКлиентами.ДобавитьПриход();
	Движение.Период = Дата;
	Движение.Контрагент = Контрагент;
	Движение.СуммаДолга = СуммаДокумента;
	
	
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц();
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	РеализацияТоваровТовары.Товар КАК Товар,
	|	СУММА(РеализацияТоваровТовары.Количество) КАК Количество,
	|	РеализацияТоваровТовары.Характеристика КАК Характеристика,
	|	Сумма(Сумма) КАК Сумма
	|ПОМЕСТИТЬ ДокТЧ
	|ИЗ
	|	Документ.РеализацияТоваров.Товары КАК РеализацияТоваровТовары
	|ГДЕ
	|	РеализацияТоваровТовары.Ссылка = &Ссылка
	|СГРУППИРОВАТЬ ПО
	|	РеализацияТоваровТовары.Товар,
	|	РеализацияТоваровТовары.Характеристика
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДокТЧ.Товар КАК Товар,
	|	ДокТЧ.Количество КАК Количество,
	|	ДокТЧ.Характеристика КАК Характеристика
	|ИЗ
	|	ДокТЧ КАК ДокТЧ";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	

	Пока Выборка.Следующий() Цикл
		Движение = Движения.ТоварыНаСкладах.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = Дата;
		Движение.Товар = Выборка.Товар;
		Движение.ХарактеристикаТовара = Выборка.Характеристика;
		Движение.Склад = Склад;
		Движение.Количество = Выборка.Количество;
	КонецЦикла;
	
	Движения.ТоварыНаСкладах.БлокироватьДляИзменения = Истина;
	
	Движения.Записать();
	

	Запрос.Текст=
	"ВЫБРАТЬ
	|	ТоварыНаСкладахОстатки.Товар,
	|	ТоварыНаСкладахОстатки.КоличествоОстаток,
	|	ТоварыНаСкладахОстатки.ХарактеристикаТовара КАК Характеристика
	|ИЗ
	|	РегистрНакопления.ТоварыНаСкладах.Остатки(&МоментВремени, Склад = &Склад
	|	И (Товар, ХарактеристикаТовара) В
	|		(ВЫБРАТЬ
	|			ДокТЧ.Товар,
	|			ДокТЧ.Характеристика
	|		ИЗ
	|			ДокТЧ КАК ДокТЧ)) КАК ТоварыНаСкладахОстатки
	|ГДЕ
	|	ТоварыНаСкладахОстатки.КоличествоОстаток < 0";
	
	Граница = Новый Граница (МоментВремени(), ВидГраницы.Включая);
	Запрос.УстановитьПараметр("Склад", Склад);
	Запрос.УстановитьПараметр("МоментВремени", Граница);
	РезультатЗапроса = Запрос.Выполнить();
	
	Если Не РезультатЗапроса.Пустой() Тогда
		Отказ = Истина;
		
		Выборка = РезультатЗапроса.Выбрать();
		Пока Выборка.Следующий() Цикл
			
		//СтрШаблон()
			Сообщить("Мало товара " + Выборка.Товар + " нужно еще " + (-Выборка.КоличествоОстаток));
			
		КонецЦикла;
	КонецЕсли;
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	Блокировка = Новый БлокировкаДанных;
	ЭлементБлокировки = Блокировка.Добавить("РегистрНакопления.СебестоимостьТоваров");
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
	ЭлементБлокировки.ИсточникДанных = Товары;
	ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Товар","Товар" );
	
	Движения.СебестоимостьТоваров.БлокироватьДляИзменения = Истина;
	Движения.СебестоимостьТоваров.Записать(); //?

	
	Запрос.Текст = "ВЫБРАТЬ
					|	СебестоимостьТоваровОстатки.Товар КАК Товар,
					|	СебестоимостьТоваровОстатки.Партия КАК Партия,
					|	СебестоимостьТоваровОстатки.КоличествоОстаток КАК КоличествоОстаток,
					|	СебестоимостьТоваровОстатки.СтоимостьОстаток КАК СтоимостьОстаток,
					|	СебестоимостьТоваровОстатки.ХарактеристикаТовара
					|ПОМЕСТИТЬ Остатки
					|ИЗ
					|	РегистрНакопления.СебестоимостьТоваров.Остатки(&МоментВремени, (Товар, ХарактеристикаТовара) В
					|		(ВЫБРАТЬ
					|			ДокТЧ.Товар,
					|			ДокТЧ.Характеристика
					|		ИЗ
					|			ДокТЧ КАК ДокТЧ)) КАК СебестоимостьТоваровОстатки
					|;
					|
					|////////////////////////////////////////////////////////////////////////////////
					|ВЫБРАТЬ
					|	ДокТЧ.Товар КАК Товар,
					|	ДокТЧ.Количество КАК Количество,
					|	ДокТЧ.Характеристика КАК Характеристика,
					|	Остатки.ХарактеристикаТовара,
					|	ДокТЧ.Сумма КАК Выручка,
					|	Остатки.Партия КАК Партия,
					|	ЕСТЬNULL(Остатки.КоличествоОстаток, 0) КАК КоличествоОстаток,
					|	Остатки.СтоимостьОстаток КАК СтоимостьОстаток
					|ИЗ
					|	ДокТЧ КАК ДокТЧ
					|		ЛЕВОЕ СОЕДИНЕНИЕ Остатки КАК Остатки
					|		ПО ДокТЧ.Характеристика = Остатки.ХарактеристикаТовара
					|
					|УПОРЯДОЧИТЬ ПО
					|	Остатки.Партия.МоментВремени,
					|	ДокТЧ.Характеристика
					|ИТОГИ
					|	Сумма(КоличествоОстаток) КАК КоличествоОстаток,
					|	Минимум(Количество) КАК Количество
					|ПО
					|	Характеристика";
	
	
	Запрос.УстановитьПараметр("МоментВремени", МоментВремени());
	Результат = Запрос.Выполнить();
	ВыборкаТовар = Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаТовар.Следующий() Цикл
		Если ВыборкаТовар.КоличествоОстаток < ВыборкаТовар.Количество Тогда

			Сообщить("Что-то пошло не так, остаток стоимости не совпадант с остатками по складу");
			Отказ = Истина;
			Возврат;
			
		КонецЕсли;
		
		ВыборкаПартия = ВыборкаТовар.Выбрать(); 
		
		ОсталосьСписать = ВыборкаТовар.Количество;
		СебестоимостьИтого = 0;
		Выручка = 0;

		Пока ВыборкаПартия.Следующий() И ОсталосьСписать <> 0 Цикл
			
			Списать = МИН(ОсталосьСписать, ВыборкаПартия.КоличествоОстаток); 
			
			
			Себестоимость = Списать / ВыборкаПартия.КоличествоОстаток * ВыборкаПартия.СтоимостьОстаток;	
			СебестоимостьИтого = СебестоимостьИтого + Себестоимость;
			Выручка = Выручка + ВыборкаПартия.Выручка;
			Товар = ВыборкаПартия.Товар;
			Движение = Движения.СебестоимостьТоваров.ДобавитьРасход();
			Движение.Период = Дата; 
			Движение.Товар = ВыборкаПартия.Товар;
			Движение.ХарактеристикаТовара = ВыборкаПартия.Характеристика;
			Движение.Партия = ВыборкаПартия.Партия;
			Движение.Количество = Списать;
			Движение.Стоимость = Себестоимость; 
			
			ОсталосьСписать = ОсталосьСписать - Списать;

			
		КонецЦикла; 
		
		
		
			Движение = Движения.Продажи.Добавить();
			Движение.Период = Дата; 
			Движение.Товар = Товар;
			Движение.Контрагент = Контрагент;
			Движение.Количество = ВыборкаТовар.Количество;
			Движение.Себестоимость = СебестоимостьИтого;
			Движение.Выручка = Выручка; // ?
			
			Проводка = Движения.РегистрБухгалтерии.Добавить();
			Проводка.Период = Дата;
			Проводка.Сумма = Выручка;
			Проводка.СчетДт = ПланыСчетов.БухУчет.Касса;
			Проводка.СчетКт = ПланыСчетов.БухУчет.Клиенты;
			
			
		
	КонецЦикла;
	
	Движения.РегистрБухгалтерии.Записывать = Истина;
	
	Движения.Продажи.Записывать = Истина;

	Движения.СебестоимостьТоваров.Записывать = Истина;	

КонецПроцедуры
